In [9]:
import pandas as pd
import os
os.getcwd()
change="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(change)
os.getcwd()
os.listdir()

['Attachments',
 'CODING',
 'desktop.ini',
 'files',
 'python',
 'sample_1000_data.csv',
 'Tailwind',
 'Telegram.lnk',
 'Visual Studio Code.lnk',
 'WPS Office.lnk',
 'WPS PDF.lnk']

In [12]:
filename="sample_1000_data.csv"
chunk_size=100
total_salary=0
for chunk in pd.read_csv(filename,chunksize=chunk_size):
    chunk["New_Salary"]=chunk["Salary"]*10
    total_salary+=chunk["New_Salary"].sum()
    print("Curent sumup of salary:",total_salary)
print("Last total:",total_salary)

Curent sumup of salary: 65272720
Curent sumup of salary: 135449750
Curent sumup of salary: 208910770
Curent sumup of salary: 278452700
Curent sumup of salary: 344283180
Curent sumup of salary: 413407420
Curent sumup of salary: 482195180
Curent sumup of salary: 549552660
Curent sumup of salary: 618306440
Curent sumup of salary: 692341040
Last total: 692341040

In [13]:
chunk.head()

      ID    Name  Age     City  Salary  New_Salary
900  901  wtVhiv   60  Kolkata   69364      693640
901  902  JFasEn   52  Kolkata  117759     1177590
902  903  KFrivn   21  Kolkata   43520      435200
903  904  gEtoju   48  Kolkata   67232      672320
904  905  fJTNLX   49   Mumbai   43547      435470

In [14]:
chunk.tail()

       ID    Name  Age       City  Salary  New_Salary
995   996  pnqMTV   31  Bangalore  107291     1072910
996   997  GqzcUo   38     Mumbai   81484      814840
997   998  tACovG   57     Mumbai  102627     1026270
998   999  RqpUZz   48    Chennai  104293     1042930
999  1000  PdFTom   32     Mumbai   97003      970030

In [15]:
chunk.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 900 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          100 non-null    int64
 1   Name        100 non-null    object
 2   Age         100 non-null    int64
 3   City        100 non-null    object
 4   Salary      100 non-null    int64
 5   New_Salary  100 non-null    int64
dtypes: int64(4), object(2)
memory usage: 4.8+ KB